// Äàííûé êîä âû÷èñëÿåò íàòóðàëüíûé ëîãàðèôì îò ïîëîæèòåëüíûõ ÷èñåë
//(Ïî ñâîéñòâàì ëîãàðèôìà ïðè ln(x), x > 0)
#include <math.h>
#include <stdio.h>

int main(){
	double sum = 0;							// sum - ïåðåìåííàÿ çíà÷åíèÿ ëîãàðèôìà
	double x = 99;							// x - ïåðåìåííàÿ çíà÷åíèÿ âõîäíîé ôóíêöèè

	if  (x > 0 && x <= 2 )					// Ñëó÷àé äëÿ ôîðìóëû X <= 2
	{
		x -= 1;

		for (int i = 1; i < 5000; i += 2)
		{
			sum += ((double)(pow(x, i)) / (double)i - (double) pow(x, i + 1) / (double)(i + 1));
		}
	}
	else if (x > 2)							// Ñëó÷àé äëÿ ôîðìóëû X > 2
	{
		for (int i = 1; i < 5000; i += 2)
		{
			x = x / (x - 1);
			sum += 1 / (i * pow(x, i));
		}
	}
	else									// Ñëó÷àé, åñëè ÷èñëî îòðèöàòåëüíîå (Âîçâðàùàåò 1 êàê ñèãíàë î íàëè÷èè îøèáêè)
		{
		printf("Error: x <= 0");
		return 1;
		}
	printf("ln=%f", sum);
}
